Tekla Open API Reference for Tekla Structures 2025
IntList.Remove Method
 Removes the first occurence of the integer from the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Remove(
	int value
)
Public Sub Remove (
	value As Integer
)
Parameters
value
Type: System.Int32
The integer to be removed.
See Also
Reference
IntList Class
Tekla.Structures.Drawing Namespace